app/Controllers/Dashboard.php

    private function getDashboardStats()
    {
        $stats = [
            'total_products' => 0,
            'low_stock_products' => 0,
            'total_users' => 0,
            'active_users' => 0
        ];

        try {
            // Get product stats
            $products = $this->productModel->getActiveProducts();
            $stats['total_products'] = count($products);

            $lowStock = $this->productModel->getLowStockProducts(10);
            $stats['low_stock_products'] = count($lowStock);

            // Get user stats (admin only)
            if ($this->isAdmin()) {
                $stats['total_users'] = count($this->userModel->findAll());
---
SELECT *
FROM `users`