app/Controllers/POS.php


            log_message('info', 'Inserting sale record');
            // Insert sale into database
            $db->table('sales')->insert($saleData);
---
INSERT INTO `sales` (`sale_code`, `total_amount`, `tax_amount`, `subtotal`, `payment_method`, `processed_by`, `created_at`) VALUES ('SALE-20260225-9709', 20.889, 1.899, 18.99, 'cash', 2, '2026-02-25 14:29:36')

                ];

                log_message('info', 'Inserting sale item: ' . $productName . ' (ID: ' . $productId . ')');
                $db->table('sale_items')->insert($saleItemData);
---
INSERT INTO `sale_items` (`sale_id`, `product_id`, `product_name`, `price`, `quantity`, `total`, `created_at`) VALUES (4, 7, 'Geek Bar Pulse Disposable', 18.99, 1, 18.99, '2026-02-25 14:29:36')