app/Controllers/Products.php

    public function index()
    {
        $search = trim((string) $this->request->getGet('q'));
        $status = strtolower(trim((string) $this->request->getGet('status')));
        $allowedStatuses = ['', 'active', 'inactive'];

        if (!in_array($status, $allowedStatuses, true)) {
            $status = '';
        }

        $products = $this->productModel->getStockManagementList($search, $status);
        $stats = $this->productModel->getStockSummary();
        $allProductsForImageMap = $this->productModel->findAll();
---
SELECT *
FROM `products`

    public function update($id)
    {
        $product = $this->productModel->find($id);

        if (!$product) {
            session()->setFlashdata('error', 'Product not found.');
            return redirect()->to('/products');
        }

        $data = $this->getProductFormData();

        if (!$this->validate($this->getValidationRules())) {
            session()->setFlashdata('error', $this->buildValidationMessage());
            return redirect()->to('/products/edit/' . $id)->withInput();
        }

        try {
            $uploadedImagePath = $this->uploadProductImage($product['image_url'] ?? null);
            if ($uploadedImagePath !== null) {
                $data['image_url'] = $uploadedImagePath;
            }

            if ($this->productModel->update($id, $data)) {
---
SELECT *
FROM `products`
WHERE `products`.`id` = '8'
UPDATE `products` SET `name` = 'POD FORMULA (30ml)', `category` = 'e-liquid', `brand` = 'CODED', `price` = 180, `stock_qty` = 1, `is_active` = 1, `updated_at` = '2026-03-19 06:23:59'
WHERE `products`.`id` IN ('8')