app/Models/ProductModel.php

    public function getStockManagementList(string $search = '', string $status = ''): array
    {
        $builder = $this->builder();

        if ($status === 'active') {
            $builder->where('is_active', 1);
        } elseif ($status === 'inactive') {
            $builder->where('is_active', 0);
        }

        if ($search !== '') {
            $builder->groupStart()
                ->like('name', $search)
                ->orLike('category', $search)
                ->orLike('brand', $search)
                ->groupEnd();
        }

        return $builder->orderBy('is_active', 'DESC')
            ->orderBy('stock_qty', 'ASC')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `products`
ORDER BY `is_active` DESC, `stock_qty` ASC, `name` ASC

    public function getStockSummary(): array
    {
        $row = $this->builder()
            ->select(
                'COUNT(*) AS total_products, ' .
                'SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) AS active_products, ' .
                'SUM(CASE WHEN is_active = 1 AND stock_qty BETWEEN 1 AND 10 THEN 1 ELSE 0 END) AS low_stock_products, ' .
                'SUM(CASE WHEN is_active = 1 AND stock_qty = 0 THEN 1 ELSE 0 END) AS out_of_stock_products',
                false
            )
            ->get()
            ->getRowArray();
---
SELECT COUNT(*) AS total_products, SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) AS active_products, SUM(CASE WHEN is_active = 1 AND stock_qty BETWEEN 1 AND 10 THEN 1 ELSE 0 END) AS low_stock_products, SUM(CASE WHEN is_active = 1 AND stock_qty = 0 THEN 1 ELSE 0 END) AS out_of_stock_products
FROM `products`