app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `is_active` = 1
ORDER BY `category` ASC, `name` ASC
---
    public function getActiveProducts()
    {
        return $this->where('is_active', 1)
                    ->orderBy('category', 'ASC')
                    ->orderBy('name', 'ASC')
                    ->findAll();

SELECT *
FROM `products`
WHERE `is_active` = 1
AND `stock_qty` <= 10
ORDER BY `stock_qty` ASC
---
    public function getLowStockProducts($threshold = 10)
    {
        return $this->where('is_active', 1)
                    ->where('stock_qty <=', $threshold)
                    ->orderBy('stock_qty', 'ASC')
                    ->findAll();

SELECT DISTINCT `category`
FROM `products`
WHERE `is_active` = 1
---
    public function getCategories()
    {
        $result = $this->select('category')
                      ->where('is_active', 1)
                      ->distinct()
                      ->findAll();

SELECT *
FROM `products`
ORDER BY `category` ASC, `brand` ASC, `name` ASC, `flavor` ASC
---
    public function getProductsGroupedByCategory(string $search = '', string $status = '', string $category = '', string $brand = ''): array
    {
        $builder = $this->builder();

        if ($status === 'active') {
            $builder->where('is_active', 1);
        } elseif ($status === 'inactive') {
            $builder->where('is_active', 0);
        }

        if ($category !== '') {
            $builder->where('category', $category);
        }

        if ($brand !== '') {
            $builder->where('brand', $brand);
        }

        if ($search !== '') {
            $builder->groupStart()
                ->like('name', $search)
                ->orLike('category', $search)
                ->orLike('brand', $search)
                ->orLike('flavor', $search)
                ->groupEnd();
        }

        $products = $builder->orderBy('category', 'ASC')
            ->orderBy('brand', 'ASC')
            ->orderBy('name', 'ASC')
            ->orderBy('flavor', 'ASC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS total_products, SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) AS active_products, SUM(CASE WHEN is_active = 1 AND stock_qty BETWEEN 1 AND 10 THEN 1 ELSE 0 END) AS low_stock_products, SUM(CASE WHEN is_active = 1 AND stock_qty = 0 THEN 1 ELSE 0 END) AS out_of_stock_products
FROM `products`
---
    public function getStockSummary(): array
    {
        $row = $this->builder()
            ->select(
                'COUNT(*) AS total_products, ' .
                'SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) AS active_products, ' .
                'SUM(CASE WHEN is_active = 1 AND stock_qty BETWEEN 1 AND 10 THEN 1 ELSE 0 END) AS low_stock_products, ' .
                'SUM(CASE WHEN is_active = 1 AND stock_qty = 0 THEN 1 ELSE 0 END) AS out_of_stock_products',
                false
            )
            ->get()
            ->getRowArray();

SELECT DISTINCT `category`
FROM `products`
WHERE `category` IS NOT NULL
AND `category` != ''
ORDER BY `category` ASC
---
    public function getDistinctCategories()
    {
        return $this->builder()
            ->select('category')
            ->where('category IS NOT NULL')
            ->where('category !=', '')
            ->distinct()
            ->orderBy('category', 'ASC')
            ->get()
            ->getResultArray();

SELECT DISTINCT `brand`
FROM `products`
WHERE `brand` IS NOT NULL
AND `brand` != ''
ORDER BY `brand` ASC
---
    public function getDistinctBrands()
    {
        return $this->builder()
            ->select('brand')
            ->where('brand IS NOT NULL')
            ->where('brand !=', '')
            ->distinct()
            ->orderBy('brand', 'ASC')
            ->get()
            ->getResultArray();

SELECT `name`, `brand`, `category`, MIN(price) as min_price, MAX(price) as max_price, SUM(stock_qty) as total_stock, GROUP_CONCAT(DISTINCT CASE WHEN flavor IS NOT NULL AND flavor != "" THEN flavor END) as flavors, GROUP_CONCAT(DISTINCT CASE WHEN puffs IS NOT NULL THEN puffs END ORDER BY puffs) as puff_counts, MIN(image_url) as image_url, COUNT(*) as variant_count
FROM `products`
WHERE `is_active` = 1
GROUP BY `name`, `brand`, `category`
ORDER BY `category` ASC, `name` ASC
---
    public function getGroupedProducts()
    {
        $builder = $this->builder();

        $result = $builder->select([
            'name',
            'brand',
            'category',
            'MIN(price) as min_price',
            'MAX(price) as max_price',
            'SUM(stock_qty) as total_stock',
            'GROUP_CONCAT(DISTINCT CASE WHEN flavor IS NOT NULL AND flavor != "" THEN flavor END) as flavors',
            'GROUP_CONCAT(DISTINCT CASE WHEN puffs IS NOT NULL THEN puffs END ORDER BY puffs) as puff_counts',
            'MIN(image_url) as image_url',
            'COUNT(*) as variant_count'
        ])
        ->where('is_active', 1)
        ->groupBy('name, brand, category')
        ->orderBy('category', 'ASC')
        ->orderBy('name', 'ASC')
        ->get()
        ->getResultArray();

SELECT *
FROM `products`
WHERE `name` = 'SMOK NOVO KIT'
AND `brand` = 'SMOK'
AND `category` = 'Device'
AND `is_active` = 1
ORDER BY `flavor` ASC, `puffs` ASC
---
    public function getProductVariants($name, $brand, $category)
    {
        return $this->where('name', $name)
                    ->where('brand', $brand)
                    ->where('category', $category)
                    ->where('is_active', 1)
                    ->orderBy('flavor', 'ASC')
                    ->orderBy('puffs', 'ASC')
                    ->findAll();