app/Models/SaleModel.php

SELECT `sales`.*, `users`.`full_name` as `cashier_name`
FROM `sales`
JOIN `users` ON `users`.`id` = `sales`.`processed_by`
WHERE DATE(sales.created_at) >= '2026-02-27'
AND DATE(sales.created_at) <= '2026-02-27'
ORDER BY `sales`.`created_at` DESC
---
    public function getSalesReport($startDate = null, $endDate = null)
    {
        $saleItemsSummarySubquery = '(SELECT sale_id, GROUP_CONCAT(product_name ORDER BY id SEPARATOR ", ") AS items_summary FROM sale_items GROUP BY sale_id) sale_items_summary';

        $builder = $this->select('
            sales.*,
            users.full_name as cashier_name,
            COALESCE(sale_items_summary.items_summary, "") as items_summary
        ')
        ->join('users', 'users.id = sales.processed_by')
        ->join($saleItemsSummarySubquery, 'sale_items_summary.sale_id = sales.id', 'left', false)
        ->orderBy('sales.created_at', 'DESC');

        if ($startDate) {
            $builder->where('DATE(sales.created_at) >=', $startDate);
        }

        if ($endDate) {
            $builder->where('DATE(sales.created_at) <=', $endDate);
        }

        return $builder->findAll();

SELECT COUNT(*) as total_sales, SUM(total_amount) as total_revenue, SUM(tax_amount) as total_tax, SUM(subtotal) as total_subtotal
FROM `sales`
WHERE DATE(created_at) >= '2026-02-27'
AND DATE(created_at) <= '2026-02-27'
 LIMIT 1
---
    public function getSalesReportPaginated($startDate = null, $endDate = null, int $perPage = 10, int $page = 1)
    {
        $saleItemsSummarySubquery = '(SELECT sale_id, GROUP_CONCAT(product_name ORDER BY id SEPARATOR ", ") AS items_summary FROM sale_items GROUP BY sale_id) sale_items_summary';

        $builder = $this->select('
            sales.*,
            users.full_name as cashier_name,
            COALESCE(sale_items_summary.items_summary, "") as items_summary
        ')
        ->join('users', 'users.id = sales.processed_by')
        ->join($saleItemsSummarySubquery, 'sale_items_summary.sale_id = sales.id', 'left', false)
        ->orderBy('sales.created_at', 'DESC');

        if ($startDate) {
            $builder->where('DATE(sales.created_at) >=', $startDate);
        }

        if ($endDate) {
            $builder->where('DATE(sales.created_at) <=', $endDate);
        }

        return $builder->paginate($perPage, 'sales', $page);