app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'staff1'
AND `is_active` = 1
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('username', $username)
                    ->where('is_active', 1)
                    ->first();

SELECT *
FROM `users`
WHERE `is_active` = 1
ORDER BY `created_at` DESC
---
    public function getActiveUsers()
    {
        return $this->where('is_active', 1)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT *
FROM `users`
ORDER BY `created_at` DESC
---
    public function getAllUsers()
    {
        return $this->orderBy('created_at', 'DESC')
                    ->findAll();

INSERT INTO `users` (`username`, `full_name`, `role`, `is_active`, `password_hash`, `created_at`, `updated_at`) VALUES ('staff1', 'staff1', 'staff', 1, '$2y$10$DdoB3yWD8Ve4KzxEXSZrS.vW/vi2ps/qi5ZB2Xin9oLoblIdFeXuW', '2026-02-27 12:05:18', '2026-02-27 12:05:18')
---
    public function createUser($data)
    {
        if (isset($data['password'])) {
            $data['password_hash'] = password_hash($data['password'], PASSWORD_DEFAULT);
            unset($data['password']);
        }

        return $this->insert($data);